### Terraform Plan: `shared`

<details><summary>Show plan</summary>

```
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=pocket-av/cloudresourcemanager.googleapis.com]
google_service_account.github_actions: Refreshing state... [id=projects/pocket-av/serviceAccounts/github-actions@pocket-av.iam.gserviceaccount.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=pocket-av/iamcredentials.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=pocket-av/artifactregistry.googleapis.com]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/pocket-av/locations/global/workloadIdentityPools/github]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=pocket-av/run.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=pocket-av/compute.googleapis.com]
google_project_service.apis["sts.googleapis.com"]: Refreshing state... [id=pocket-av/sts.googleapis.com]
google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=pocket-av/servicenetworking.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=pocket-av/iam.googleapis.com]
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=pocket-av/sqladmin.googleapis.com]
google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=pocket-av/vpcaccess.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=pocket-av/secretmanager.googleapis.com]
google_iam_workload_identity_pool_provider.github_actions: Refreshing state... [id=projects/pocket-av/locations/global/workloadIdentityPools/github/providers/github-actions]
google_service_account_iam_member.wif_binding: Refreshing state... [id=projects/pocket-av/serviceAccounts/github-actions@pocket-av.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/148242134126/locations/global/workloadIdentityPools/github/attribute.repository/blnz/pocket-av]
google_project_iam_member.github_actions_run_admin: Refreshing state... [id=pocket-av/roles/run.admin/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
google_project_iam_member.github_actions_viewer: Refreshing state... [id=pocket-av/roles/viewer/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
google_project_iam_member.github_actions_sa_user: Refreshing state... [id=pocket-av/roles/iam.serviceAccountUser/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
google_project_iam_member.github_actions_ar_writer: Refreshing state... [id=pocket-av/roles/artifactregistry.writer/serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com]
google_compute_global_address.private_ip_range: Refreshing state... [id=projects/pocket-av/global/addresses/private-ip-range]
google_artifact_registry_repository.docker: Refreshing state... [id=projects/pocket-av/locations/us-central1/repositories/pocket-av]
google_service_networking_connection.private_vpc: Refreshing state... [id=projects%2Fpocket-av%2Fglobal%2Fnetworks%2Fdefault:servicenetworking.googleapis.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_dns_managed_zone.web will be created
  + resource "google_dns_managed_zone" "web" {
      + creation_time    = (known after apply)
      + description      = "DNS zone for pocket-rad.io"
      + dns_name         = "pocket-rad.io."
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "pocket-rad-io"
      + name_servers     = (known after apply)
      + project          = "pocket-av"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + visibility       = "public"

      + cloud_logging_config (known after apply)

      + dnssec_config (known after apply)
    }

  # google_project_iam_member.github_actions_lb_admin will be created
  + resource "google_project_iam_member" "github_actions_lb_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:github-actions@pocket-av.iam.gserviceaccount.com"
      + project = "pocket-av"
      + role    = "roles/compute.loadBalancerAdmin"
    }

  # google_project_service.apis["dns.googleapis.com"] will be created
  + resource "google_project_service" "apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pocket-av"
      + service            = "dns.googleapis.com"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dns_name_servers          = (known after apply)
  + dns_zone_name             = "pocket-rad-io"
  + domain                    = "pocket-rad.io"
  + github_actions_sa_email   = "github-actions@pocket-av.iam.gserviceaccount.com"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>